Revit 2027 API
Level.ProjectElevation Property
 Retrieves the elevation relative to project origin, no matter what values of the Elevation Base parameter is set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ProjectElevation { get; }
Public ReadOnly Property ProjectElevation As Double
	Get
public:
property double ProjectElevation {
	double get ();
}
member ProjectElevation : float with get
Property Value
Double
Remarks
 This read only property returns the elevation relative to project origin.
See Also
Reference
Level Class
Autodesk.Revit.DB Namespace